Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxHssl_bf.h
/** \brief Mask for Ifx_HSSL_SEC_Bits.LAW */
#define IFX_HSSL_SEC_LAW_MSK (0x1u)

/** \brief Offset for Ifx_HSSL_SEC_Bits.LAW */
#define IFX_HSSL_SEC_LAW_OFF (1u)

/** \brief Length for Ifx_HSSL_MSCR_Bits.EN */
#define IFX_HSSL_MSCR_EN_LEN (1u)

/** \brief Mask for Ifx_HSSL_MSCR_Bits.EN */
#define IFX_HSSL_MSCR_EN_MSK (0x1u)

/** \brief Offset for Ifx_HSSL_MSCR_Bits.EN */
#define IFX_HSSL_MSCR_EN_OFF (0u)

/** \brief Length for Ifx_HSSL_MSCR_Bits.SLAVETAG */
#define IFX_HSSL_MSCR_SLAVETAG_LEN (2u)

/** \brief Mask for Ifx_HSSL_MSCR_Bits.SLAVETAG */
#define IFX_HSSL_MSCR_SLAVETAG_MSK (0x3u)

/** \brief Offset for Ifx_HSSL_MSCR_Bits.SLAVETAG */
#define IFX_HSSL_MSCR_SLAVETAG_OFF (1u)

/** \brief Length for Ifx_HSSL_MSCR_Bits.ITXSTOP */
#define IFX_HSSL_MSCR_ITXSTOP_LEN (1u)

/** \brief Mask for Ifx_HSSL_MSCR_Bits.ITXSTOP */
#define IFX_HSSL_MSCR_ITXSTOP_MSK (0x1u)

/** \brief Offset for Ifx_HSSL_MSCR_Bits.ITXSTOP */
#define IFX_HSSL_MSCR_ITXSTOP_OFF (16u)

/** \brief Length for Ifx_HSSL_IS_SA_Bits.START */
#define IFX_HSSL_IS_SA_START_LEN (27u)

/** \brief Mask for Ifx_HSSL_IS_SA_Bits.START */
#define IFX_HSSL_IS_SA_START_MSK (0x7ffffffu)

/** \brief Offset for Ifx_HSSL_IS_SA_Bits.START */
#define IFX_HSSL_IS_SA_START_OFF (5u)

/** \brief Length for Ifx_HSSL_IS_CA_Bits.CURR */
#define IFX_HSSL_IS_CA_CURR_LEN (27u)

/** \brief Mask for Ifx_HSSL_IS_CA_Bits.CURR */
#define IFX_HSSL_IS_CA_CURR_MSK (0x7ffffffu)

/** \brief Offset for Ifx_HSSL_IS_CA_Bits.CURR */
#define IFX_HSSL_IS_CA_CURR_OFF (5u)

/** \brief Length for Ifx_HSSL_IS_FC_Bits.RELCOUNT */
#define IFX_HSSL_IS_FC_RELCOUNT_LEN (16u)

/** \brief Mask for Ifx_HSSL_IS_FC_Bits.RELCOUNT */
#define IFX_HSSL_IS_FC_RELCOUNT_MSK (0xffffu)

/** \brief Offset for Ifx_HSSL_IS_FC_Bits.RELCOUNT */
#define IFX_HSSL_IS_FC_RELCOUNT_OFF (0u)

/** \brief Length for Ifx_HSSL_IS_FC_Bits.CURCOUNT */
#define IFX_HSSL_IS_FC_CURCOUNT_LEN (16u)

/** \brief Mask for Ifx_HSSL_IS_FC_Bits.CURCOUNT */
#define IFX_HSSL_IS_FC_CURCOUNT_MSK (0xffffu)

/** \brief Offset for Ifx_HSSL_IS_FC_Bits.CURCOUNT */
#define IFX_HSSL_IS_FC_CURCOUNT_OFF (16u)

/** \brief Length for Ifx_HSSL_TS_SA_Bits.ADDR */
#define IFX_HSSL_TS_SA_ADDR_LEN (27u)

/** \brief Mask for Ifx_HSSL_TS_SA_Bits.ADDR */
#define IFX_HSSL_TS_SA_ADDR_MSK (0x7ffffffu)

/** \brief Offset for Ifx_HSSL_TS_SA_Bits.ADDR */
#define IFX_HSSL_TS_SA_ADDR_OFF (5u)

/** \brief Length for Ifx_HSSL_TS_CA_Bits.CURR */
#define IFX_HSSL_TS_CA_CURR_LEN (27u)

/** \brief Mask for Ifx_HSSL_TS_CA_Bits.CURR */
#define IFX_HSSL_TS_CA_CURR_MSK (0x7ffffffu)

/** \brief Offset for Ifx_HSSL_TS_CA_Bits.CURR */
#define IFX_HSSL_TS_CA_CURR_OFF (5u)

/** \brief Length for Ifx_HSSL_TS_FC_Bits.RELCOUNT */
#define IFX_HSSL_TS_FC_RELCOUNT_LEN (16u)

/** \brief Mask for Ifx_HSSL_TS_FC_Bits.RELCOUNT */
#define IFX_HSSL_TS_FC_RELCOUNT_MSK (0xffffu)

/** \brief Offset for Ifx_HSSL_TS_FC_Bits.RELCOUNT */
#define IFX_HSSL_TS_FC_RELCOUNT_OFF (0u)

/** \brief Length for Ifx_HSSL_TS_FC_Bits.CURCOUNT */
#define IFX_HSSL_TS_FC_CURCOUNT_LEN (16u)

/** \brief Mask for Ifx_HSSL_TS_FC_Bits.CURCOUNT */
#define IFX_HSSL_TS_FC_CURCOUNT_MSK (0xffffu)

/** \brief Offset for Ifx_HSSL_TS_FC_Bits.CURCOUNT */
#define IFX_HSSL_TS_FC_CURCOUNT_OFF (16u)

/** \brief Length for Ifx_HSSL_AW_AWSTART_Bits.AWS */
#define IFX_HSSL_AW_AWSTART_AWS_LEN (24u)

/** \brief Mask for Ifx_HSSL_AW_AWSTART_Bits.AWS */
#define IFX_HSSL_AW_AWSTART_AWS_MSK (0xffffffu)

/** \brief Offset for Ifx_HSSL_AW_AWSTART_Bits.AWS */
#define IFX_HSSL_AW_AWSTART_AWS_OFF (8u)

/** \brief Length for Ifx_HSSL_AW_AWEND_Bits.AWE */
#define IFX_HSSL_AW_AWEND_AWE_LEN (24u)

/** \brief Mask for Ifx_HSSL_AW_AWEND_Bits.AWE */
#define IFX_HSSL_AW_AWEND_AWE_MSK (0xffffffu)

/** \brief Offset for Ifx_HSSL_AW_AWEND_Bits.AWE */
#define IFX_HSSL_AW_AWEND_AWE_OFF (8u)

/** \brief Length for Ifx_HSSL_AR_Bits.ARW0 */
#define IFX_HSSL_AR_ARW0_LEN (2u)

/** \brief Mask for Ifx_HSSL_AR_Bits.ARW0 */
#define IFX_HSSL_AR_ARW0_MSK (0x3u)

/** \brief Offset for Ifx_HSSL_AR_Bits.ARW0 */
#define IFX_HSSL_AR_ARW0_OFF (0u)

/** \brief Length for Ifx_HSSL_AR_Bits.ARW1 */
#define IFX_HSSL_AR_ARW1_LEN (2u)

/** \brief Mask for Ifx_HSSL_AR_Bits.ARW1 */
#define IFX_HSSL_AR_ARW1_MSK (0x3u)

/** \brief Offset for Ifx_HSSL_AR_Bits.ARW1 */
#define IFX_HSSL_AR_ARW1_OFF (2u)

/** \brief Length for Ifx_HSSL_AR_Bits.ARW2 */
#define IFX_HSSL_AR_ARW2_LEN (2u)

/** \brief Mask for Ifx_HSSL_AR_Bits.ARW2 */
#define IFX_HSSL_AR_ARW2_MSK (0x3u)

/** \brief Offset for Ifx_HSSL_AR_Bits.ARW2 */
#define IFX_HSSL_AR_ARW2_OFF (4u)

/** \brief Length for Ifx_HSSL_AR_Bits.ARW3 */
#define IFX_HSSL_AR_ARW3_LEN (2u)

/** \brief Mask for Ifx_HSSL_AR_Bits.ARW3 */
#define IFX_HSSL_AR_ARW3_MSK (0x3u)

/** \brief Offset for Ifx_HSSL_AR_Bits.ARW3 */
#define IFX_HSSL_AR_ARW3_OFF (6u)

/** \brief Length for Ifx_HSSL_AR_Bits.MAVCH */
#define IFX_HSSL_AR_MAVCH_LEN (2u)

/** \brief Mask for Ifx_HSSL_AR_Bits.MAVCH */
#define IFX_HSSL_AR_MAVCH_MSK (0x3u)

/** \brief Offset for Ifx_HSSL_AR_Bits.MAVCH */
#define IFX_HSSL_AR_MAVCH_OFF (16u)

/** \brief Length for Ifx_HSSL_OCS_Bits.TGS */
#define IFX_HSSL_OCS_TGS_LEN (2u)

/** \brief Mask for Ifx_HSSL_OCS_Bits.TGS */
#define IFX_HSSL_OCS_TGS_MSK (0x3u)

/** \brief Offset for Ifx_HSSL_OCS_Bits.TGS */
#define IFX_HSSL_OCS_TGS_OFF (0u)

/** \brief Length for Ifx_HSSL_OCS_Bits.TGB */
#define IFX_HSSL_OCS_TGB_LEN (1u)

/** \brief Mask for Ifx_HSSL_OCS_Bits.TGB */
#define IFX_HSSL_OCS_TGB_MSK (0x1u)

/** \brief Offset for Ifx_HSSL_OCS_Bits.TGB */
#define IFX_HSSL_OCS_TGB_OFF (2u)

/** \brief Length for Ifx_HSSL_OCS_Bits.TG_P */
#define IFX_HSSL_OCS_TG_P_LEN (1u)

/** \brief Mask for Ifx_HSSL_OCS_Bits.TG_P */
#define IFX_HSSL_OCS_TG_P_MSK (0x1u)

/** \brief Offset for Ifx_HSSL_OCS_Bits.TG_P */
#define IFX_HSSL_OCS_TG_P_OFF (3u)

/** \brief Length for Ifx_HSSL_OCS_Bits.SUS */
#define IFX_HSSL_OCS_SUS_LEN (4u)

/** \brief Mask for Ifx_HSSL_OCS_Bits.SUS */
#define IFX_HSSL_OCS_SUS_MSK (0xfu)

/** \brief Offset for Ifx_HSSL_OCS_Bits.SUS */
#define IFX_HSSL_OCS_SUS_OFF (24u)

/** \brief Length for Ifx_HSSL_OCS_Bits.SUS_P */
#define IFX_HSSL_OCS_SUS_P_LEN (1u)

